In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('FoodBa.csv', encoding='latin1')
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [4]:
df.tail()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

In [5]:
df.shape

(60943, 12)

In [6]:
df.dtypes

Area Code         int64
Area             object
Item Code         int64
Item             object
Element Code      int64
Element          object
Unit             object
Y2014           float64
Y2015           float64
Y2016           float64
Y2017           float64
Y2018           float64
dtype: object

In [7]:
df.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

In [8]:
duplicate_rows_df= df[df.duplicated()]
print("Number of duplicate rows:",duplicate_rows_df.shape)

Number of duplicate rows: (0, 12)

In [9]:
df.count()

Area Code       60943
Area            60943
Item Code       60943
Item            60943
Element Code    60943
Element         60943
Unit            60943
Y2014           59354
Y2015           59395
Y2016           59408
Y2017           59437
Y2018           59507
dtype: int64

In [11]:
print(df.isnull().sum())

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

### Q1 Which year had the least correlation with ‘Element Code?

In [34]:
subset = df[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018', 'Element Code']]
correlation_scores = subset.corr()['Element Code']

least_correlated_year = correlation_scores.idxmin()
min_correlation_score = correlation_scores.min()

print(correlation_scores)

print("Year with the least correlation:", least_correlated_year)
print("Correlation score:", min_correlation_score)

Y2014           0.024457
Y2015           0.023889
Y2016           0.023444
Y2017           0.024254
Y2018           0.024279
Element Code    1.000000
Name: Element Code, dtype: float64
Year with the least correlation: Y2016
Correlation score: 0.02344399758496104

### Q2. Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

In [17]:
stock_variation_data = df[df['Element'] == 'Stock Variation']

columns_to_display = ['Element', 'Area', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']

print(stock_variation_data[columns_to_display])

               Element      Area  Y2014   Y2015  Y2016  Y2017   Y2018
13     Stock Variation   Algeria  684.0  1663.0  905.0  705.0  2226.0
29     Stock Variation   Algeria  487.0  1401.0  731.0  546.0  1927.0
45     Stock Variation   Algeria    8.0    -2.0   -4.0   17.0    37.0
60     Stock Variation   Algeria   42.0    82.0   55.0   16.0   134.0
75     Stock Variation   Algeria  146.0   177.0  122.0  127.0   124.0
...                ...       ...    ...     ...    ...    ...     ...
60842  Stock Variation  Zimbabwe    0.0     0.0    0.0    0.0     0.0
60853  Stock Variation  Zimbabwe    0.0     0.0    0.0    0.0     0.0
60914  Stock Variation  Zimbabwe    0.0     0.0    0.0   -4.0     0.0
60924  Stock Variation  Zimbabwe    0.0     0.0    0.0    0.0     0.0
60934  Stock Variation  Zimbabwe    0.0     0.0    0.0   -4.0     0.0

[4232 rows x 7 columns]

In [18]:
stock_variation_data = df[df['Element'] == 'Stock Variation']

yearly_sum = stock_variation_data[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum()

max_stock_variation_year = yearly_sum.idxmax()

print("Yearly sum of Stock Variation:")
print(yearly_sum)
print("Year with the highest sum of Stock Variation:", max_stock_variation_year)

Yearly sum of Stock Variation:
Y2014    58749.83
Y2015    34910.99
Y2016    33140.12
Y2017    54316.91
Y2018    20577.91
dtype: float64
Year with the highest sum of Stock Variation: Y2014

### Q3 Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

In [22]:
grouped_data = selected_data.groupby('Area')['Y2017'].sum().reset_index()

sorted_data = grouped_data.sort_values(by='Y2017')

sorted_data.reset_index(drop=True, inplace=True)

print("Table of Sums for Each Area in 2017:")
print(sorted_data)

seventh_lowest_area = sorted_data.iloc[6]['Area']
seventh_lowest_sum = sorted_data.iloc[6]['Y2017']
print("\nArea with the 7th lowest sum in 2017:", seventh_lowest_area, "(Sum:", seventh_lowest_sum, ")")

Table of Sums for Each Area in 2017:
                           Area       Y2017
0                Sudan (former)        0.00
1                  Ethiopia PDR        0.00
2                       Comoros       59.84
3                    Seychelles      442.34
4         Sao Tome and Principe    12662.63
5                    Cabo Verde    14650.74
6                 Guinea-Bissau    19102.77
7                       Lesotho    21267.96
8                      Botswana    22101.30
9                      Djibouti    22729.91
10                       Gambia    23154.18
11                        Gabon    27979.64
12                      Liberia    29342.20
13                      Namibia    29874.89
14     Central African Republic    29937.00
15                        Congo    41181.68
16                         Togo    49841.88
17                    Mauritius    51114.83
18                     Eswatini    54343.33
19                 Sierra Leone    55311.33
20                         Chad    71594.68
21                       Rwanda    73663.69
22                     Zimbabwe    75919.34
23                      Senegal    95681.15
24                       Guinea    98138.87
25                 Burkina Faso   101855.07
26                       Zambia   103223.77
27                      Tunisia   124167.20
28                        Benin   124771.22
29                        Niger   126707.58
30                   Madagascar   131197.73
31                         Mali   149928.33
32                   Mauritania   156665.46
33                   Mozambique   161407.98
34                       Malawi   181098.71
35                       Uganda   213950.38
36                Côte d'Ivoire   224599.01
37                       Angola   229159.57
38                     Cameroon   232030.43
39                        Sudan   239931.92
40                        Kenya   264660.66
41  United Republic of Tanzania   322616.85
42                      Algeria   325644.27
43                        Ghana   337599.06
44                      Morocco   388495.36
45                     Ethiopia   448683.76
46                 South Africa   517590.54
47                        Egypt   866379.92
48                      Nigeria  1483268.23

Area with the 7th lowest sum in 2017: Guinea-Bissau (Sum: 19102.77 )

### Q4 What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [24]:
#we can check it from df.describe()
df.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

### OR

In [25]:
year_2017_data = df['Y2017']

mean_2017 = year_2017_data.mean()
std_dev_2017 = year_2017_data.std()

print("Mean for the year 2017:", round(mean_2017, 2))
print("Standard deviation for the year 2017:", round(std_dev_2017, 2))

Mean for the year 2017: 140.92
Standard deviation for the year 2017: 1671.86

### Q5 How would you check for the number of rows and columns in a pandas DataFrame named df?

In [26]:
df.shape

(60943, 12)

### Q6 What would be the output for?

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

In [27]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

### Q7 Given the following python code, what would the output of the code give?

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

In [28]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

In [29]:
#The output of the code would be a Type Error.
#The reason is that tuples in Python are immutable, meaning you cannot change their elements after creation. 
#Therefore, attempting to assign a new value to an element of a tuple will result in a TypeError.

### Q8 What is the total number of unique countries in the dataset?

In [13]:
unique_countries = df['Area'].nunique()

print("Total unique countries in the dataset:", unique_countries)

Total unique countries in the dataset: 49

### Q9 Consider the following list of tuples:

y = [(2, 4), (7, 8), (1, 5, 9)]

How would you assign element 8 from the list to a variable x?

In [30]:
y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][1]

# Print the value of x
print(x)

8

### Q10 Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [15]:
grouped_data = df.groupby("Element")["Y2017"].sum()
print(grouped_data)

Element
Domestic supply quantity                  2088198.10
Export Quantity                            182338.80
Fat supply quantity (g/capita/day)          10253.84
Feed                                       223705.68
Food                                      1258888.28
Food supply (kcal/capita/day)              454681.00
Food supply quantity (kg/capita/yr)         48690.04
Import Quantity                            294559.09
Losses                                     160614.00
Other uses (non-food)                       91645.97
Processing                                 292836.00
Production                                2030056.89
Protein supply quantity (g/capita/day)      11842.45
Residuals                                   35500.00
Seed                                        24870.14
Stock Variation                             54316.91
Total Population - Both sexes             1112641.00
Tourist consumption                            91.00
Name: Y2017, dtype: float64

In [16]:
sum_processing = grouped_data.loc["Processing"]
print("Sum of 'Processing' in Y2017:", sum_processing)

Sum of 'Processing' in Y2017: 292836.0

### Q11 What is the total Protein supply quantity in Madagascar in 2015?

In [31]:
madagascar_protein_data = df.loc[(df['Area'] == 'Madagascar') & (df['Element'] == 'Protein supply quantity (g/capita/day)'), ['Area', 'Element', 'Y2015']]

print("DataFrame for Protein supply quantity in Madagascar in 2015:")
print(madagascar_protein_data)

total_protein_supply_2015 = madagascar_protein_data['Y2015'].sum()
print("\nTotal Protein supply quantity in Madagascar in 2015:", total_protein_supply_2015)

DataFrame for Protein supply quantity in Madagascar in 2015:
             Area                                 Element  Y2015
30718  Madagascar  Protein supply quantity (g/capita/day)  43.26
30721  Madagascar  Protein supply quantity (g/capita/day)  34.04
30724  Madagascar  Protein supply quantity (g/capita/day)   9.23
30740  Madagascar  Protein supply quantity (g/capita/day)  27.26
30756  Madagascar  Protein supply quantity (g/capita/day)   2.14
...           ...                                     ...    ...
32113  Madagascar  Protein supply quantity (g/capita/day)   0.01
32123  Madagascar  Protein supply quantity (g/capita/day)   0.00
32133  Madagascar  Protein supply quantity (g/capita/day)   0.02
32142  Madagascar  Protein supply quantity (g/capita/day)   0.00
32152  Madagascar  Protein supply quantity (g/capita/day)   0.01

[111 rows x 3 columns]

Total Protein supply quantity in Madagascar in 2015: 173.04999999999998

### Q12 What is the total sum of Wine produced in 2015 and 2018 respectively?

In [32]:
wine_data = df[df['Item'].str.contains('Wine')]

print(wine_data[['Item', 'Y2015', 'Y2018']])

wine_2015 = wine_data['Y2015']
wine_2018 = wine_data['Y2018']

total_wine_2015 = wine_2015.sum()
total_wine_2018 = wine_2018.sum()

print("\nTotal Wine produced in 2015:", total_wine_2015)
print("Total Wine produced in 2018:", total_wine_2018)

                          Item   Y2015    Y2018
665    Fruits - Excluding Wine  4498.0  4605.00
666    Fruits - Excluding Wine   539.0   125.00
667    Fruits - Excluding Wine    -3.0     0.00
668    Fruits - Excluding Wine    36.0    54.00
669    Fruits - Excluding Wine  5004.0  4676.00
...                        ...     ...      ...
60551                     Wine     4.0     4.00
60552                     Wine     0.3     0.31
60553                     Wine     1.0     1.00
60554                     Wine     0.0     0.00
60555                     Wine     0.0     0.00

[1088 rows x 3 columns]

Total Wine produced in 2015: 287109.0
Total Wine produced in 2018: 294420.78

### Q13 Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [33]:
selected_data = df[['Y2017', 'Area']]
grouped_data = selected_data.groupby('Area').sum()
area_with_highest_sum = grouped_data['Y2017'].idxmax()
highest_sum_value = grouped_data['Y2017'].max()

print("Table of Y2017 sums by area:")
print(grouped_data)

print("\nHighest sum value in 2017:", highest_sum_value)
print("Area with the highest sum in 2017:", area_with_highest_sum)

Table of Y2017 sums by area:
                                  Y2017
Area
Algeria                       325644.27
Angola                        229159.57
Benin                         124771.22
Botswana                       22101.30
Burkina Faso                  101855.07
Cabo Verde                     14650.74
Cameroon                      232030.43
Central African Republic       29937.00
Chad                           71594.68
Comoros                           59.84
Congo                          41181.68
Côte d'Ivoire                 224599.01
Djibouti                       22729.91
Egypt                         866379.92
Eswatini                       54343.33
Ethiopia                      448683.76
Ethiopia PDR                       0.00
Gabon                          27979.64
Gambia                         23154.18
Ghana                         337599.06
Guinea                         98138.87
Guinea-Bissau                  19102.77
Kenya                         264660.66
Lesotho                        21267.96
Liberia                        29342.20
Madagascar                    131197.73
Malawi                        181098.71
Mali                          149928.33
Mauritania                    156665.46
Mauritius                      51114.83
Morocco                       388495.36
Mozambique                    161407.98
Namibia                        29874.89
Niger                         126707.58
Nigeria                      1483268.23
Rwanda                         73663.69
Sao Tome and Principe          12662.63
Senegal                        95681.15
Seychelles                       442.34
Sierra Leone                   55311.33
South Africa                  517590.54
Sudan                         239931.92
Sudan (former)                     0.00
Togo                           49841.88
Tunisia                       124167.20
Uganda                        213950.38
United Republic of Tanzania   322616.85
Zambia                        103223.77
Zimbabwe                       75919.34

Highest sum value in 2017: 1483268.23
Area with the highest sum in 2017: Nigeria